# UFuncs: Index Preservation

In [1]:
import numpy as np
import pandas as pd

In [2]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0,10,4))
ser

0    6
1    3
2    7
3    4
dtype: int32

In [4]:
df = pd.DataFrame((rng.randint(0,10,(3,4))),
                  columns=['a','b','c','d'])
df

   a  b  c  d
0  1  7  5  1
1  4  0  9  5
2  8  0  9  2

In [5]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [6]:
np.sin(df * np.pi / 4)

              a         b         c         d
0  7.071068e-01 -0.707107 -0.707107  0.707107
1  1.224647e-16  0.000000  0.707107 -0.707107
2 -2.449294e-16  0.000000  0.707107  1.000000

# UFuncs: Index Alignment

In [9]:
area = pd.Series({'Ha Noi': 3358.9,
             'Thanh Hoa': 11130.2,            
             'Hue': 5033.2}, name='area')
pop = pd.Series({'Ha Noi':8053663,                   
                   'Da Nang': 1134310,
                   'Hue': 1128620}, name='pop')

In [10]:
pop / area

Da Nang              NaN
Ha Noi       2397.708476
Hue           224.235079
Thanh Hoa            NaN
dtype: float64

In [11]:
area.index | pop.index

C:\Users\nguye\AppData\Local\Temp/ipykernel_19180/4072340695.py:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead
  area.index | pop.index

Index(['Da Nang', 'Ha Noi', 'Hue', 'Thanh Hoa'], dtype='object')

In [12]:
A = pd.Series([1,2,3], index=[0,1,2])
B = pd.Series([3,4,5], index=[1,2,3])
A + B

0    NaN
1    5.0
2    7.0
3    NaN
dtype: float64

In [13]:
A.add(B, fill_value=0)

0    1.0
1    5.0
2    7.0
3    5.0
dtype: float64

# UFuncs: Index Alignment in DataFrame

In [15]:
A = pd.DataFrame(rng.randint(0,10,(2,2)),
                columns=list('AB'))
A

   A  B
0  4  2
1  6  4

In [16]:
B = pd.DataFrame(rng.randint(0,10,(3,3)),
                columns=list('BAC'))
B

   B  A  C
0  8  6  1
1  3  8  1
2  9  8  9

In [17]:
A + B

      A     B   C
0  10.0  10.0 NaN
1  14.0   7.0 NaN
2   NaN   NaN NaN

In [18]:
A.add(B, fill_value=0)

      A     B    C
0  10.0  10.0  1.0
1  14.0   7.0  1.0
2   8.0   9.0  9.0

# UFuncs: Operations Between DataFrame and Series

In [19]:
A = rng.randint(0,10,(3,4))
A

array([[4, 1, 3, 6],
       [7, 2, 0, 3],
       [1, 7, 3, 1]])

In [20]:
A - A[0]

array([[ 0,  0,  0,  0],
       [ 3,  1, -3, -3],
       [-3,  6,  0, -5]])

In [22]:
df = pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1  3  1 -3 -3
2 -3  6  0 -5

In [24]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0  3  0  2  5
1  5  0 -2  1
2 -6  0 -4 -6

In [25]:
halfrow = df.iloc[0,::2]
halfrow

Q    4
S    3
Name: 0, dtype: int32

In [26]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1  3.0 NaN -3.0 NaN
2 -3.0 NaN  0.0 NaN